# parameters
nc: 80  # number of classes
depth_multiple1: 0.33  # model depth multiple
width_multiple1: 0.25  # layer channel multiple
depth_multiple2: 0.67  # model depth multiple
width_multiple2: 0.75  # layer channel multiple

# anchors
anchors:
  - [ 19,27,  44,40,  38,94 ]  # P3/8
  - [ 96,68,  86,152,  180,137 ]  # P4/16
  - [ 140,301,  303,264,  238,542 ]  # P5/32
  - [ 436,615,  739,380,  925,792 ]  # P6/64

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, Focus, [ 64, 3 ] ],  # 0-P1/2
    [ -1, 1, Conv, [ 128, 3, 2 ] ],  # 1-P2/4
    [ -1, 3, C3, [ 128 ] ],
    [ -1, 1, Conv, [ 256, 3, 2 ] ],  # 3-P3/8
    [ -1, 9, C3, [ 256 ] ],
    [ -1, 1, Conv, [ 512, 3, 2 ] ],  # 5-P4/16
    [ -1, 9, C3, [ 512 ] ],
    [ -1, 1, Conv, [ 768, 3, 2 ] ],  # 7-P5/32
    [ -1, 3, C3, [ 768 ] ],
    [ -1, 1, Conv, [ 1024, 3, 2 ] ],  # 9-P6/64
    [ -1, 1, SPP, [ 1024, [ 3, 5, 7 ] ] ],
    [ -1, 3, C3, [ 1024, False ] ],  # 11
    [ -1, 1, Conv, [ 768, 1, 1 ] ], #12
  ]

# YOLOv5 head
head:
  [ #[-1, 1, Conv, [768, 1, 1]], # 13 - 12
    [-1, 1, DeConv, [1024, 1, 1]], # 14 - 11
    [-1, 3, DeconvC3, [1024, False]], # 15 - 10
    [-1, 1, DeconvSPP, [1024, [3, 5, 7]]], # 16 - 9
    [-1, 1, DeConv, [768, 3, 2]], # 17 - 8
    [-1, 3, DeconvC3, [768]], # 18 - 7
    [-1, 1, DeConv, [512, 3, 2]], # 19 - 6
    [-1, 9, DeconvC3, [512]], # 20 - 5
    [-1, 1, DeConv, [256, 3, 2]], # 21 - 4
  
    [ 12, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 16 ], 1, Concat, [ 1 ] ],  # cat backbone P5
    [ -1, 3, C3, [ 768, False ] ],  # 15

    [ -1, 1, Conv, [ 512, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 18 ], 1, Concat, [ 1 ] ],  # cat backbone P4
    [ -1, 3, C3, [ 512, False ] ],  # 19

    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 20 ], 1, Concat, [ 1 ] ],  # cat backbone P3
    [ -1, 3, C3, [ 256, False ] ],  # 23 (P3/8-small)

    [ -1, 1, Conv, [ 256, 3, 2 ] ],
    [ [ -1, 28 ], 1, Concat, [ 1 ] ],  # cat head P4
    [ -1, 3, C3, [ 512, False ] ],  # 26 (P4/16-medium)

    [ -1, 1, Conv, [ 512, 3, 2 ] ],
    [ [ -1, 24 ], 1, Concat, [ 1 ] ],  # cat head P5
    [ -1, 3, C3, [ 768, False ] ],  # 29 (P5/32-large)

    [ -1, 1, Conv, [ 768, 3, 2 ] ],
    [ [ -1, 12 ], 1, Concat, [ 1 ] ],  # cat head P6
    [ -1, 3, C3, [ 1024, False ] ],  # 32 (P6/64-xlarge)

    [ [ 31, 34, 37, 40], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5, P6)
  ]

