# parameters
nc: 80  # number of classes
depth_multiple1: 0.33  # model depth multiple
width_multiple1: 0.25  # layer channel multiple
depth_multiple2: 0.67  # model depth multiple
width_multiple2: 0.75  # layer channel multiple

# depth_multiple1: 1
# width_multiple1: 1
# depth_multiple2: 1
# width_multiple2: 1

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],                     # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],                  # 1-P2/4
   [-1, 3, C3, [128]],                          # 2
   [-1, 1, Conv, [256, 3, 2]],                  # 3-P3/8
   [-1, 9, C3, [256]],                          # 4
   [-1, 1, Conv, [512, 3, 2]],                  # 5-P4/16
   [-1, 9, C3, [512]],                          # 6
   [-1, 1, Conv, [1024, 3, 2]],                 # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],            # 8
   [-1, 3, C3, [1024, False]],                  # 9

   [-1, 1, Conv, [512, 1, 1]],                  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],                   # 12 cat backbone P4
   [-1, 3, C3, [512, False]],                   # 13

   [-1, 1, Conv, [256, 1, 1]],                  # 14
  ]

# YOLOv5 head
head:  
  [[-1, 1, DeConv, [512, 1, 1]],                # 15 - 14
   [-1, 3, DeconvC3, [1024, False]],            # 16 - 13
   [-1, 1, TensorSplit, [0]],                   # 17 - 12
   [-1, 1, nn.MaxPool2d, [2, 2]],               # 18 - 11 pooling
   [-1, 1, DeConv, [1024, 1, 1]],               # 19 - 10
   [-1, 3, DeconvC3, [1024, False]],            # 20 - 9
   [-1, 1, DeconvSPP, [1024, [5, 9, 13]]],      # 21 - 8
   [-1, 1, DeConv, [512, 3, 2]],                # 22 - 7
   [-1, 9, DeconvC3, [512]],                    # 23 - 6
   [-1, 1, DeConv, [512, 3, 2]],                # 24 - 5

   [14, 1, nn.Upsample, [None, 2, 'nearest']],  # 25
   [[-1, 24], 1, Concat, [1]],                  # 26 cat backbone P3
   [-1, 3, C3, [256, False]],                   # 27 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],                  # 28
   [[-1, 14], 1, Concat, [1]],                  # 29 cat head P4
   [-1, 3, C3, [512, False]],                   # 30 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                  # 31
   [[-1, 18], 1, Concat, [1]],                  # 32 cat head P5
   [-1, 3, C3, [1024, False]],                  # 33 (P5/32-large)


   [[27, 30, 33], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]


