# parameters
nc: 80  # number of classes
depth_multiple1: 0.33  # model depth multiple
width_multiple1: 0.25  # layer channel multiple
depth_multiple2: 0.67  # model depth multiple
width_multiple2: 0.75  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, SPConv, [256, 0, 3, 2]],  # 3-P3/8
   [-1, 1, RecoveryUnit, [256, 0, 1, 1]],  # 4 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, SPConv, [512, 1, 3, 2]],  # 6 5-P4/16
   [-1, 1, RecoveryUnit, [512, 1, 1, 1]],  # 7 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, SPConv, [1024, 2, 3, 2]],  # 9 7-P5/32
   [-1, 1, RecoveryUnit, [1024, 2, 1, 1]],  # 10 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 12
   [-1, 1, SPConv, [512, 3, 1, 1]], # 13
   [-1, 1, RecoveryUnit, [512, 3, 1, 1]] # 14
  ]

# YOLOv5 head
head:
  [
   [-1, 1, DeConv, [1024, 1, 1]], # 15 11 - 9
   [-1, 3, DeconvC3, [1024, False]], # 16 12 - 8
   [-1, 1, DeconvSPP, [1024, [5, 9, 13]]], # 17 13 - 7
   [-1, 1, DeConv, [512, 3, 2]], # 18 14 - 6
   [-1, 9, DeconvC3, [512]], # 19 15 - 5
   [-1, 1, DeConv, [256, 3, 2]], # 20 16 - 4
   
   [14, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 18], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 20], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 24], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[27, 30, 33], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

